Revit 2024 API
LoadBase.OrientTo Property
 The load orientation option.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public LoadOrientTo OrientTo { get; set; }
Visual Basic
Public Property OrientTo As LoadOrientTo
	Get
	Set
Visual C++
public:
property LoadOrientTo OrientTo {
	LoadOrientTo get ();
	void set (LoadOrientTo value);
}
Remarks
 For hosted load only LoadOrientTo.Project and LoadOrientTo.HostLocalCoordinateSystem are permitted. For non-hosted load only LoadOrientTo.Project and LoadOrientTo.WorkPlane are permitted. To determine if load is hosted use IsHosted property.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: orientTo is not permitted for this type of load.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
LoadBase Class
Autodesk.Revit.DB.Structure Namespace